; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p3---int100n150-m25---int100c150---s14---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level5 level5)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level5 level6)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level5 level7)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level5 level8)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level5 level9)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level5 level10)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level5 level11)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level5 level12)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level5 level13)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level5 level14)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level5 level15)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level5 level16)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level5 level17)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level5 level18)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level5 level19)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level5 level20)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level5 level21)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level5 level22)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level5 level23)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level5 level24)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level5 level25)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level5 level26)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level5 level27)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level5 level28)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level5 level29)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level5 level30)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level5 level31)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level5 level32)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level5 level33)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level5 level34)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level5 level35)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level5 level36)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level5 level37)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level5 level38)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level5 level39)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level5 level40)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level5 level41)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level5 level42)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level1 level39)
(sum level38 level5 level43)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level1 level40)
(sum level39 level5 level44)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level1 level41)
(sum level40 level5 level45)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level1 level42)
(sum level41 level5 level46)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level42 level1 level43)
(sum level42 level5 level47)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level43 level1 level44)
(sum level43 level5 level48)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level44 level1 level45)
(sum level44 level5 level49)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level45 level1 level46)
(sum level45 level5 level50)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level46 level1 level47)
(sum level46 level5 level51)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level47 level1 level48)
(sum level47 level5 level52)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level48 level1 level49)
(sum level48 level5 level53)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level49 level1 level50)
(sum level49 level5 level54)
(sum level49 level20 level69)
(sum level50 level1 level51)
(sum level50 level5 level55)
(sum level50 level20 level70)
(sum level51 level1 level52)
(sum level51 level5 level56)
(sum level52 level1 level53)
(sum level52 level5 level57)
(sum level53 level1 level54)
(sum level53 level5 level58)
(sum level54 level1 level55)
(sum level54 level5 level59)
(sum level55 level1 level56)
(sum level55 level5 level60)
(sum level56 level1 level57)
(sum level56 level5 level61)
(sum level57 level1 level58)
(sum level57 level5 level62)
(sum level58 level1 level59)
(sum level58 level5 level63)
(sum level59 level1 level60)
(sum level59 level5 level64)
(sum level60 level1 level61)
(sum level60 level5 level65)
(sum level61 level1 level62)
(sum level61 level5 level66)
(sum level62 level1 level63)
(sum level62 level5 level67)
(sum level63 level1 level64)
(sum level63 level5 level68)
(sum level64 level1 level65)
(sum level64 level5 level69)
(sum level65 level1 level66)
(sum level65 level5 level70)
(sum level66 level1 level67)
(sum level67 level1 level68)
(sum level68 level1 level69)
(sum level69 level1 level70)

(connected l0 l1)
(fuelcost level20 l0 l1)
(connected l0 l2)
(fuelcost level1 l0 l2)
(connected l0 l3)
(fuelcost level20 l0 l3)
(connected l1 l0)
(fuelcost level20 l1 l0)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l1 l3)
(fuelcost level5 l1 l3)
(connected l2 l0)
(fuelcost level1 l2 l0)
(connected l2 l1)
(fuelcost level22 l2 l1)
(connected l2 l3)
(fuelcost level24 l2 l3)
(connected l3 l0)
(fuelcost level20 l3 l0)
(connected l3 l1)
(fuelcost level5 l3 l1)
(connected l3 l2)
(fuelcost level24 l3 l2)

(at t0 l1)
(fuel t0 level70)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l2 level48 level22 level70)
   deleted: (at t0 l1) (fuel t0 level70)
   added: (at t0 l2) (fuel t0 level48)
   goals met: 0 of 3
2. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 3
3. (drive t0 l2 l3 level24 level24 level48)
   deleted: (at t0 l2) (fuel t0 level48)
   added: (at t0 l3) (fuel t0 level24)
   goals met: 0 of 3
4. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 3
5. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 3
6. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 1 of 3
7. (drive t0 l3 l2 level0 level24 level24)
   deleted: (at t0 l3) (fuel t0 level24)
   added: (at t0 l2) (fuel t0 level0)
   goals met: 1 of 3
8. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 2 of 3
9. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 3 of 3
